#pragma once
#include <cstdint>

// 格式:
// --------------------------------常量定义
// --------------------------------枚举
// --------------------------------类/结构体声明
// --------------------------------类型别名
// --------------------------------函数别名
// --------------------------------指针别名

namespace network {
	// --------------------------------常量定义
	constexpr uint32_t io_type_tnum = 3;	//io类型数
	// --------------------------------枚举
	// 服务端状态
	enum class server_status {
		null,
		run,		//运行
		close,		//关闭
		destroy,	//销毁
	};
	// 客户端状态
	enum class client_status {
		null,
		run,		//运行
		close,		//关闭
		destroy,	//销毁
	};
	// io类型
	enum class io_type {
		null,
		read,	//读
		write,	//写
	};
	// --------------------------------类/结构体声明
	// --------------------------------类型别名
	// --------------------------------函数别名
	// --------------------------------指针别名
}